
CREATE INDEX ON "cs_user" USING HASH ("nickname"); -- будет полезно при добавлении в друзья по нику

CREATE INDEX ON "cs_user" USING HASH ("id"); -- различные join's, поиски по id

CREATE INDEX ON "skin" USING HASH ("name"); -- поиск скина на торговой площадке по названию

CREATE INDEX ON "skin" USING HASH ("id"); -- различные join's, поиски по id

--------------------------------------------------------------------------------------------------------
-- CREATE INDEX ON "skin_for_sale" USING BTREE ("price"); -- в теории может понадобиться, если на торговой площадке введем фильтры по цене
--------------------------------------------------------------------------------------------------------